pipeline {
    agent any
    stages {
        // ===============================================
        //           CI (지속적 통합) 영역
        // ===============================================
        stage('Build') {
            steps {
                echo '1. 소스코드를 빌드합니다...'
            }
        }
        stage('Test') {
            steps {
                echo '2. 자동화된 테스트를 실행합니다...'
                // (지금은 이 부분이 'Pipeline Success!'로 대체됨)
            }
        }
        
        // ===============================================
        //           CD (지속적 배포) 영역
        // ===============================================
        stage('Deploy') {
            steps {
                echo '3. 테스트를 통과한 결과물을 실제 서버에 배포합니다!'
            }
        }
    }
}
